// about 
export const aboutText = [
  {
    title: "성장을 즐기는 개발자",
    desc: "나는 항상 자기주도적으로 문제를 해결하고 새로운 기술을 익히는데 즐거움을 느낍니다. 배움에 대한 열정으로 지식을 쌓으며 성장하는 모습을 보여드리고 싶습니다. 끊임없는 도전과 개발의 즐거움을 통해 저만의 발전을 이루고자 합니다.",
  },
  {
    title: "열정과 팀워크로 혁신을 이끄는 개발자",
    desc: "나는 프론트엔드 개발에 대한 끊임없는 열정과 팀워크를 가지고 있습니다. 새로운 기술과 트렌드를 학습하고, 팀원들과 협력하여 혁신적인 솔루션을 창출하는 것을 즐깁니다. 사용자 중심의 웹 경험을 위해 최선을 다하며, 함께 성장하고 발전하는 개발자로서 기여하고자 합니다.",
  },
  {
    title: "디자인과 기술의 융합 개발자",
    desc: "나는 디자인과 기술의 융합을 통해 창의적인 웹 애플리케이션을 개발하는 것을 즐깁니다. 사용자들에게 아름다운 UI/UX를 제공하면서도 기술적으로 혁신적인 서비스를 구현하고자 합니다. 디자인과 개발의 조합으로 독창적인 웹 경험을 제공하는데 주력하며, 끊임없는 탐구와 실험으로 새로운 가능성을 모색합니다.",
  },
];

// skills
export const skillText = [
  {
      title: "코어 언어에 대한 기본기",
      text: "저는 HTML, CSS, SASS, JavaScript, jQuery, TypeScript 등의 코어 언어를 다루는 프론트엔드 개발자입니다. 웹 디자인과 사용자 경험을 개선하는데 열정을 갖고 있으며, 효율적이고 섬세한 코드 작성을 지향합니다. 새로운 기술과 트렌드를 익히고 항상 성장하며 멋진 웹 애플리케이션을 만들어내는 것이 목표입니다!",
      code: "https://github.com/webstoryboy/port2023-vite",
      view: "https://port2023-vite.netlify.app",
      tag: ["HTML", "CSS", "SASS", "JavaScript", "jQuery", "TypeScript"],
  },
  {
      title: "리액트 기반 웹 개발",
      text: "리액트 기반의 웹 애플리케이션 개발이 가능하며, 프론트엔드 개발 도구를 사용하여 빠르고 효율적인 개발 환경을 구축합니다. NPM을 활용하여 모듈 관리와 라이브러리 사용을 원활하게 처리합니다. 최신 웹 트렌드와 동향에 관심을 가지며, 사용자 경험에 중점을 두는 개발을 추구합니다.",
      code: "https://github.com/webstoryboy/port2023-vite",
      view: "https://port2023-vite.netlify.app",
      tag: ["React", "Vite.js", "NPM"],
  },
  {
      title: "프로젝트 운용 능력",
      text: "Git과 GitHub를 활용합니다. 기본적인 버전 관리와 브랜치 전략을 이해하고 있으며, 기본적인 협업 흐름을 따라 코드를 업로드하고 리뷰를 받을 수 있습니다. 더 많은 경험과 학습을 통해 실력을 향상시키고 있습니다.",
      code: "https://github.com/webstoryboy/port2023-vite",
      view: "https://port2023-vite.netlify.app",
      tag: ["git", "github"],
  },

];

// works
export const worksText = [
  {
    id: 1,
    title: "뉴스 포커스",
    desc: "React로 개발된 빠르고 직관적인 뉴스 웹앱. 다양한 주제별 실시간 뉴스 제공, 반응형 디자인. 간편하게 뉴스를 확인하고 스크랩할 수 있습니다.",
    img: '/images/work1.png',
    code: "/",
    url: "#",
  },
  {
    id: 2,
    title: "포토 갤러리",
    desc: "React로 개발된 포토 갤러리 앱. 다양한 필터로 사진을 꾸며보세요. 손쉬운 공유 기능과 편리한 저장 기능을 제공합니다. 사진을 편집하고 공유하는 재미를 느껴보세요!",
    img: '/images/work2.jpg',
    code: "/",
    url: "#",
  },
  {
    id: 3,
    title: "블로그",
    desc: "React로 개발된 블로그 웹앱. 차분한 분위기의 디자인과 편리한 블로깅 기능으로 사용자들의 글쓰기를 응원합니다. 블로그를 통해 여러 이야기를 나누고 공유하세요!",
    img: '/images/work3.jpg',
    code: "/",
    url: "#",
  },
  {
    id: 4,
    title: "디자인 포트폴리오",
    desc: "개인 포트폴리오 웹사이트입니다. 다양한 프로젝트와 작업물을 소개하며, 효과적인 디자인과 사용자 경험을 강조한 사이트입니다. 브라우징의 즐거움을 느껴보세요!",
    img: '/images/work4.jpg',
    code: "/",
    url: "#",
  },
  {
    id: 5,
    title: "디지털 아트 갤러리",
    desc: "디지털 아트 전시 웹사이트. 다양한 예술가들의 작품을 감상하고 컬렉션을 구성할 수 있습니다. 아름다운 UI와 반응형 레이아웃으로 모든 기기에서 최적의 시각적 경험을 제공합니다.",
    img: '/images/work5.jpg',
    code: "/",
    url: "#",
  },
  {
    id: 6,
    title: "점심 메뉴 고르기",
    desc: "점심메뉴 추천 웹앱. 매일 다양한 식당의 점심메뉴를 추천해드립니다. 빠르고 간편한 UI로 원하는 메뉴를 선택해보세요!",
    img: '/images/work6.jpg',
    code: "/",
    url: "#",
  },
]
